Get and Set the type of the grid object.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
 Syntax
  C#
[ObsoleteAttribute("This property is deprecated in Revit 2016. Use GetTypeId() and ChangeTypeId() instead.")]
public GridType GridType { get; set; }
  Visual Basic
<ObsoleteAttribute("This property is deprecated in Revit 2016. Use GetTypeId() and ChangeTypeId() instead.")> _
Public Property GridType As GridType
	Get
	Set
  Visual C++
[ObsoleteAttribute(L"This property is deprecated in Revit 2016. Use GetTypeId() and ChangeTypeId() instead.")]
public:
property GridType^ GridType {
	GridType^ get ();
	void set (GridType^ value);
}
 Remarks
 When    a null reference (  Nothing  in Visual Basic)  is input for the method set, ArgumentNullException will be thrown.
 See Also
  Grid Class
  Autodesk.Revit.DB Namespace